# ATFNonUniformScalingTransform Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ATFNonUniformScalingTransform Property
BuiltInFailures..::..ImportFailures Class See Also
---
The imported geometry contains non-uniform scaling transformations which Revit does not support. Some objects may be displaced or distorted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ATFNonUniformScalingTransform { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ATFNonUniformScalingTransform As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ATFNonUniformScalingTransform {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace